In [7]:
import pandas as pd
import numpy as np  # For numerical operation
import matplotlib.pyplot as plt  # For data visualization
import seaborn as sns  # For advanced visualizations

In [8]:
df=pd.read_csv(r'C:\Users\asus\Downloads\dataset_olympic.csv')
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70000 entries, 0 to 69999
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      70000 non-null  int64
 1   Name    70000 non-null  object
 2   Sex     70000 non-null  object
 3   Age     67268 non-null  float64
 4   Height  53746 non-null  float64
 5   Weight  52899 non-null  float64
 6   Team    70000 non-null  object
 7   NOC     70000 non-null  object
 8   Games   70000 non-null  object
 9   Year    70000 non-null  int64
 10  Season  70000 non-null  object
 11  City    70000 non-null  object
 12  Sport   70000 non-null  object
 13  Event   70000 non-null  object
 14  Medal   9690 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 8.0+ MB

In [10]:
df.describe()

                 ID           Age        Height        Weight          Year
count  70000.000000  67268.000000  53746.000000  52899.000000  70000.000000
mean   18081.846986     25.644645    175.505303     70.900216   1977.766457
std    10235.613253      6.485239     10.384203     14.217489     30.103306
min        1.000000     11.000000    127.000000     25.000000   1896.000000
25%     9325.750000     21.000000    168.000000     61.000000   1960.000000
50%    18032.000000     25.000000    175.000000     70.000000   1984.000000
75%    26978.000000     28.000000    183.000000     79.000000   2002.000000
max    35658.000000     88.000000    223.000000    214.000000   2016.000000

In [11]:
df.isnull().sum()

ID            0
Name          0
Sex           0
Age        2732
Height    16254
Weight    17101
Team          0
NOC           0
Games         0
Year          0
Season        0
City          0
Sport         0
Event         0
Medal     60310
dtype: int64

In [12]:
df.duplicated().sum()

np.int64(383)

In [13]:
df.drop_duplicates(inplace=True)

In [14]:
df.duplicated().sum()

np.int64(0)

In [15]:
print(df.columns)

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [16]:
print("Total unique athletes:", df['Name'].nunique())

Total unique athletes: 35556

In [17]:
print("Total unique sports:", df['Sport'].nunique())

Total unique sports: 65

In [19]:
print("Total unique events:", df['Event'].nunique())

Total unique events: 744

In [21]:
print("Most common sports:\n",df['Sport'].value_counts().head(10))

Most common sports:
 Sport
Athletics               10629
Gymnastics               6248
Swimming                 5964
Fencing                  3096
Shooting                 3040
Cycling                  2788
Rowing                   2690
Alpine Skiing            2326
Cross Country Skiing     2153
Football                 1959
Name: count, dtype: int64

In [22]:
print("Most common events:\n",df['Event'].value_counts().head(10))

Most common events:
 Event
Football Men's Football                   1738
Hockey Men's Hockey                       1133
Ice Hockey Men's Ice Hockey               1009
Basketball Men's Basketball                921
Water Polo Men's Water Polo                911
Cycling Men's Road Race, Individual        737
Rowing Men's Coxed Eights                  648
Athletics Men's 4 x 100 metres Relay       591
Athletics Men's 100 metres                 585
Gymnastics Men's Individual All-Around     583
Name: count, dtype: int64

In [23]:
medal_counts = df.groupby('NOC')['Medal'].count().sort_values(ascending=False)
print(medal_counts)

NOC
USA    1561
FRA     657
ITA     604
GBR     603
URS     515
       ...
WIF       0
YEM       0
YAR       0
YMD       0
ZAM       0
Name: Medal, Length: 226, dtype: int64